src/InformationRegisters/ПереченьСпециальныхОбстоятельствДокументаЭДО/ПереченьСпециальныхОбстоятельствДокументаЭДО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПереченьСпециальныхОбстоятельствДокументаЭДО</name>
  <resources>
    <name>Наименование</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>Родитель</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Код</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/ПереченьСпециальныхОбстоятельствДокументаЭДО/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

// Обновить перечень спец обстоятельств.
// 
// Параметры:
//  Данные - Строка - Строка JSON содержит массив структур:
//  *Parent - Строка - Наименование родителя
//  *Child - Массив Из Структура:
//  **Code - Строка - Код
//  **Name - Строка - Наименование
Процедура ОбновитьПереченьСпецОбстоятельств(Данные) Экспорт
	
	Операция = НСтр("ru = 'Обновление перечня кодов специальных обстоятельств';
					|en = 'Обновление перечня кодов специальных обстоятельств'");
	
	Если Не ЗначениеЗаполнено(Данные) Тогда
		ПодробныйТекстОшибки = НСтр("ru = 'Передана пустая строка JSON';
									|en = 'Передана пустая строка JSON'");
		ЭлектронноеВзаимодействие.ОбработатьОшибку(Операция, ПодробныйТекстОшибки);
		Возврат;
	КонецЕсли;
	Попытка
		ПереченьСпецОбстоятельств = ОбщегоНазначенияБЭД.JSONЗначение(Данные);
	Исключение
		ПодробныйТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ТекстОшибки = НСтр("ru = 'Ошибка чтения json с перечнем кодов специальных обстоятельств';
							|en = 'Ошибка чтения json с перечнем кодов специальных обстоятельств'");
		ЭлектронноеВзаимодействие.ОбработатьОшибку(Операция, ПодробныйТекстОшибки, ТекстОшибки);
		Возврат;
	КонецПопытки;
	ТаблицаРегистра = Новый ТаблицаЗначений;
	Строка5 = ОбщегоНазначения.ОписаниеТипаСтрока(5);
	СтрокаНеограниченная = Новый ОписаниеТипов("Строка");
	ТаблицаРегистра.Колонки.Добавить("Код", Строка5);
	ТаблицаРегистра.Колонки.Добавить("Наименование", СтрокаНеограниченная);
	ТаблицаРегистра.Колонки.Добавить("Родитель", СтрокаНеограниченная);
	Для Каждого ДанныеРодителя Из ПереченьСпецОбстоятельств Цикл
		Для Каждого ДанныеЗаписи Из ДанныеРодителя.Child Цикл
			СтрокаЗаписи = ТаблицаРегистра.Добавить();
			СтрокаЗаписи.Код = ДанныеЗаписи.Code;
			СтрокаЗаписи.Наименование = ДанныеЗаписи.Name;
			СтрокаЗаписи.Родитель = ДанныеРодителя.Parent;
		КонецЦикла;
	КонецЦикла;
	ТаблицаРегистра.Свернуть("Код, Родитель, Наименование");
	УстановитьПривилегированныйРежим(Истина);
	НачатьТранзакцию();
	Попытка
	
		Блокировка = Новый БлокировкаДанных;
		Блокировка.Добавить("РегистрСведений.ПереченьСпециальныхОбстоятельствДокументаЭДО");
		Блокировка.Заблокировать();
	
		НаборЗаписейРегистра = СоздатьНаборЗаписей();
		НаборЗаписейРегистра.Прочитать();
		НаборЗаписейРегистра.Загрузить(ТаблицаРегистра);
		
		ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписейРегистра);
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		ТекстОшибки = НСтр("ru = 'При обновлении перечня кодов специальных обстоятельств произошла ошибка';
							|en = 'При обновлении перечня кодов специальных обстоятельств произошла ошибка'");
		ПодробныйТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЭлектронноеВзаимодействие.ОбработатьОшибку(Операция, ПодробныйТекстОшибки, ТекстОшибки);
		
	КонецПопытки;
КонецПроцедуры

// Описание специального обстоятельства ФНС.
// 
// Параметры:
//  КодСпециальногоОбстоятельства - Строка -Код специального обстоятельства
// 
// Возвращаемое значение:
//  Структура - Описание специального обстоятельства ФНС:
// * Код - Строка
// * Наименование - Строка
Функция ОписаниеСпециальногоОбстоятельстваФНС(КодСпециальногоОбстоятельства) Экспорт
	Результат = Новый Структура("Код, Наименование", "", "");
	МенеджерЗаписи = СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Код = КодСпециальногоОбстоятельства;
	МенеджерЗаписи.Прочитать();
	ЗаполнитьЗначенияСвойств(Результат, МенеджерЗаписи);
	Возврат Результат;
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ОбработатьДанныеДляПереходаНаНовуюВерсию(Параметры) Экспорт
	Если Параметры.Свойство("ДанныеИзСервиса") Тогда
		ОбновитьПереченьСпецОбстоятельств(Параметры.ДанныеИзСервиса);
	Иначе
		ТекстМакет = ПолучитьМакет("ПереченьСпециальныхОбстоятельствДокументаЭДО");
		ОбновитьПереченьСпецОбстоятельств(ТекстМакет.ПолучитьТекст());
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#КонецЕсли
